[
    {
        "job_title": "Manager, Technical Program Management",
        "company_name": "LinkedIn",
        "job_description": "LinkedIn is the world’s largest professional network, built to create economic opportunity for every member of the global workforce. Our products help people make powerful connections, discover exciting opportunities, build necessary skills, and gain valuable insights every day. We’re also committed to providing transformational opportunities for our own employees by investing in their growth. We aspire to create a culture that’s built on trust, care, inclusion, and fun – where everyone can succeed.Join us to transform the way the world works.At LinkedIn, our approach to flexible work is centered on trust and optimized for culture, connection, clarity, and the evolving needs of our business. The work location of this role is hybrid, meaning it will be performed both from home and from a LinkedIn office on select days, as determined by the business needs of the team.This role will be based in Mountain View, CA.Our Information Technology (IT) organization is focused on empowering LinkedIn employees to do their best work every day. We do this by building enterprise infrastructure at scale, building products or services that accelerate the productivity of all LinkedIn employees. LinkedIn is looking for a Manager, Technical Program Management (TPM) for their Information Technology Technical Program Management org. In this role you will partner with engineering leaders across IT to successfully develop delivery roadmaps for partner teams, establish clear TPM governance, provide insights into execution, and closely monitor and call out major risks for the portfolio. The ideal candidate will have technical, organizational, and technical program management skills, as well as a solid track record of delivering large, complex programs successfully. This role will manage a team of TPMs that lead programs focused on Azure Infra, Networking, Unified Communications, Internal tools, and Content technology. In addition to managing a group of TPMs, this role will partner with key technical leaders to define, prioritize and drive program portfolios, governance practices, and frameworks within the engineering org.The candidate will have technical skills, and can execute and deliver successful programs in situations where authority is not a given. Responsibilities:• Lead, build, and scale the IT TPM team. This involves hiring, developing, mentoring and coaching Technical Program Managers.• Develop strategic project roadmaps and resource plans in partnership with the leadership team. • Manage and balance the resource allocation for the IT portfolio; based on priorities and availability. • Partner with engineering leadership on project execution and delivering successful outcomes.• Drive adoption of the right project management methodologies throughout the organization through templatization. • Improve process efficiency for planning, monitoring, and risk assessment within the team, and when required scale appropriately with the company.• Foster a psychologically safe work environment that fosters autonomy, transparency, collaborations, and innovation. • Help reduce project conflicts through reviews and raise awareness of issues, and risks before escalation.• Scale the team to act as the gateway between organizations to assure dependencies and alignment are built at the right levels. • Coach and mentor other TPMs within the community, and broader company as whole. Basic Qualifications:• B.S. in Computer Science or related technical field, or equivalent relevant experience.• 3+ years of people management experience managing technical program management teams.• 5+ years of program management experience as IC or as tech lead within an Engineering organization.• Experience leading high-impact, cross-company technical initiatives from concept to production. Ability to influence product and technology decisions.Preferred Qualifications:• Ability to drive cross-functional and cross-organizational communication with attention to detail.• Experience with software engineering practices and familiarity with coding techniques.• Comprehensive knowledge of Agile methods and practices through multiple teams (Scrum and Kanban).• Technical domain knowledge of scalable architecture, distributed infrastructure in Azure, AWS, or Google Cloud. • Ability to traverse both vertically and horizontally in a large organization.• Ability to traverse tactical and strategic objectives.Suggested Skills:• People Management• Technical Leadership• Technical Program ManagementLinkedIn is committed to fair and equitable compensation practices.The pay range for this role is $134,000 to $221,000. Actual compensation packages are based on several factors that are unique to each candidate, including but not limited to skill set, depth of experience, certifications, and specific work location. This may be different in other locations due to differences in the cost of labor.The total compensation package for this position may also include annual performance bonus, stock, benefits and/or other applicable incentive compensation plans. For more information, visit https://careers.linkedin.com/benefits.Equal Opportunity Statement LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: https://microsoft.sharepoint.com/:b:/t/LinkedInGCI/EeE8sk7CTIdFmEp9ONzFOTEBM62TPrWLMHs4J1C_QxVTbg?e=5hfhpE. Please reference https://www.eeoc.gov/sites/default/files/2023-06/22-088_EEOC_KnowYourRights6.12ScreenRdr.pdf and https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information. LinkedIn is committed to offering an inclusive and accessible experience for all job seekers, including individuals with disabilities. Our goal is to foster an inclusive and accessible workplace where everyone has the opportunity to be successful. If you need a reasonable accommodation to search for a job opening, apply for a position, or participate in the interview process, connect with us at accommodations@linkedin.com and describe the specific accommodation requested for a disability-related limitation. Reasonable accommodations are modifications or adjustments to the application or hiring process that would enable you to fully participate in that process. Examples of reasonable accommodations include but are not limited to: -Documents in alternate formats or read aloud to you -Having interviews in an accessible location -Being accompanied by a service dog -Having a sign language interpreter present for the interview A request for an accommodation will be responded to within three business days. However, non-disability related requests, such as following up on an application, will not receive a response. LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information. Pay Transparency Policy Statement As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency. Global Data Privacy Notice for Job Candidates This document provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://lnkd.in/GlobalDataPrivacyNotice\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "pay_information": "\n      $134,000.00/yr - $221,000.00/yr\n    ",
        "job_description_page_link": "https://www.linkedin.com/jobs/view/manager-technical-program-management-at-linkedin-4152411579?trk=public_jobs_topcard-title",
        "job_location": [
            "Mountain View, CA"
        ]
    },
    {
        "job_title": "Sr. Program Manager- Digital Transformation",
        "company_name": "Largeton Group",
        "job_description": "Title: Sr. Program Manager Location: Remote Duration:: 12+ Months MOI: Call/ VideoJD:: Field of Expertise: Management of Data and/or Digital projects Working Environment: Agile Industry: Financial Services Team Collaboration: Will be working with Scrum teams, Delivery leads and Technical leads across various projects Working Hours: Must be available during EST hours\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "pay_information": null,
        "job_description_page_link": "https://www.linkedin.com/jobs/view/sr-%C2%A0program-manager-digital-transformation-at-largeton-group-4191471579?trk=public_jobs_topcard-title",
        "job_location": [
            "United States"
        ]
    },
    {
        "job_title": "Technical Program Manager (Remote - PST or CST)-5042",
        "company_name": "itD",
        "job_description": "Job DescriptioniTalent Digital is seeking a Technical Program Manager to join our Technology Practice Group. This is a remote (work from home) role in PST or CST preferred. This is an exciting role for the right individual to continue to cultivate your skills and domain expertise.The individual selected will be instrumental in helping us continue to deliver excellence to our base of marquee Fortune 500 accounts.You will also interact closely with our iTalent Practice Directors, who will partner with you and provide ongoing coaching and mentoring.iTalent Digital offers medical benefits, 401k, paid holidays and more!The main function of a technical project manager is to plan, direct, or coordinate activities in such fields as information systems, systems analysis, and computer programming.Job Responsibilities:Review project plans to plan and coordinate project activity.Manage backup, security and user help system.Consult with users, management, vendors, and technicians to assess computing needs and system requirements.Meet with department heads, managers, supervisors, vendors, and others, to solicit cooperation and resolve problems.Provide users with technical support for computer problems.Recruit, hire, train and supervise staff, or participate in staffing decisions.Evaluate data processing proposals to assess project feasibility and requirements.Develop and interpret organizational goals, policies, and procedures.Develop computer information resources, providing for data security and control, strategic computing, and disaster recovery.engineer to identify technical automations to support search efficiency, other content and taxonomy related project management)GSD boards (task management tool) to look at program progressEscalation supportHosting daily standups to review progress of GSD boards and tasks. Any resource timelines and risksRecap notes and action items to follow up with stakeholdersPrepare for launchManage risk registerThe internal responsibilities will be as follows:Attend regular internal practice community meetings.Collaborate with your iTD practice team on industry thought leadership.Complete client case studies and learning material. (Blogs, media material).Build out material to contribute to Digital Transformation practice.Attend internal iTD networking events (in person and virtual).Work with leadership on career fast-track opportunities.Required qualifications and skillsMust have:HR information discovery, salesforce experience, case management workflow, developing portals, GenAI (agentic exp).looking for a driver to get things done focus on data scrum experience for HR Technology reporting and analytic10 years exp.Verbal and written communication skills, problem solving skills, attention to detail and interpersonal skills.Strong ability to work independently and manage one’s time.Strong leadership and mentoring skills necessary to provide support and constructive performance feedback.Strong knowledge of circuit boards, processors, electronic equipment and computer hardware and software.Strong knowledge of production processes, quality control, costs and other techniques for maximizing the effective manufacture and distribution of goods.Strong knowledge of business and management principles involved in strategic planning, resource allocation, and production methods.Strong knowledge of computer software, such as Visual Basic, Java, SQL, etc.Preferred qualifications and skillsMBA or other related advanced degree preferred.AI or ML experienceWorkday certification / salesforce certification / Safe certification / agile certification / PMPEducation• Bachelor's degree in a technical field such as computer science, computer engineering or related field required.Company descriptionAbout iTalent Digital:​ ​ We are part of a new generation of consulting and software development company that blends diversity, innovation, and integrity with real business results. Our structure rejects any strong hierarchy, empowering us to deliver excellent results. We are a woman- and minority-led firm. Every day, we challenge ourselves to be considerate, fair and to re-think what great outcomes mean for our customers. This permeates down to how we approach every interaction, on every project, for every client. You’ll thrive here if you are a dynamic self-starter, a difference-maker or someone who wants to deliver great results, without constraints. ​ The iTalent Digital Experience:​ ​ Joining us means you’ll be part of our global community, you have a say about your own career journey, and you’ll get a chance to give back to causes that matter. You will experience working with Fortune 500 companies and high-performance teams across numerous industries.  iTalent Digital offers our employees excellent benefits such as medical, dental, vision, life insurance, paid holidays, 401K + matching, networking & career learning and development programs. We are growing and we want to see you grow!​ ​ Visit https://www.italentdigital.com/careers to learn more about what working at iTalent can mean for you.  All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability or protected veteran status, or any other legally protected basis, in accordance with applicable law.  iTalent is committed to working with and providing reasonable accommodation to individuals with disabilities. If, because of a medical condition or disability, you need a reasonable accommodation for any part of the application process, or to perform the essential functions of a position, please contact us at recruiting@italentdigital.com and let us know the nature of your request and your contact information.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "pay_information": null,
        "job_description_page_link": "https://www.linkedin.com/jobs/view/technical-program-manager-remote-pst-or-cst-5042-at-itd-4177767751?trk=public_jobs_topcard-title",
        "job_location": [
            "United States"
        ]
    },
    {
        "job_title": "Manager, Technical Program Management",
        "company_name": "Meta",
        "job_description": "Are you looking to shape the future of computing? Reality Labs (RL) brings together cutting-edge research and engineering to develop products and experiences that advance immersive computing, helping people connect with entertainment, information, and one another.Reality Labs is developing software for both Augmented Reality (AR) and Virtual Reality (VR), serving billions of users worldwide. Our team is growing, and we are seeking experienced Technical Program Manager (TPM) Managers to align strategically with cross-functional teams and drive product programs for the Avatars and Economy teams. Meta Avatars enables billions of people to create digital representations of themselves and feel present together seamlessly across spaces, even when they are miles apart. The Economy team powers how hundreds of millions of people buy digital goods from millions of World Creators and App Developers.As a TPM Manager, you will lead and support a team of TPMs to drive highly cross-functional projects that shape the way users interact with our devices. This role involves collaborating with software engineers, interaction designers, release management, and quality assurance teams, integrating their efforts into a cohesive program and ensuring successful execution.Manager, Technical Program Management Responsibilities:Build, manage, and provide strategic direction for teams while supporting the growth and success of individual team members.Identify and address systemic, organization-wide challenges while fostering cross-functional relationships and driving influence. Collaborate with Product Management and Engineering to define business needs, support strategic planning and execution, and establish key metrics, program requirements, and scope.Serve as a cross-functional partner by leading technical discussions and providing thought leadership during product reviews. Take ownership of designing and implementing process and strategy frameworks that drive product-related goal setting, informed decision-making, and measurable business impact.Communicate your team’s technology requirements, goals, and milestones clearly to stakeholders, ensuring alignment and transparency throughout the development process.Leverage your technical expertise, industry knowledge, and awareness of emerging trends to drive informed decision-making and shape business strategy through data-driven analysis.Create and oversee comprehensive project plans, ensuring timely and successful delivery of all milestones.Lead program management efforts throughout all phases, including analysis, design, development, testing, implementation, and post-implementation.Manage risks and changes throughout the course of projects, ensuring timely identification and mitigation of potential issues.Shape program/product direction and streamline complexity for more efficient execution and delivery.Minimum Qualifications:Bachelor's degree in Computer Science or a related technical field, or equivalent experience.12+ years of experience in the software industry, including systems engineering, hardware engineering, or technical product/program management.7+ years of experience in people management, leading teams to deliver technical programs or products from inception to delivery.Experience communicating and presenting work to leadership, framing discussions to gather valuable feedback, and collaborating with technical management teams to develop systems, solutions, and products.Experience in analytical thinking and problem-solving with large-scale systems.Experience in establishing and leading teams through cross-disciplinary collaborations, including product management and engineering, to drive product impact.Preferred Qualifications:Experience in organizational design and scaling teams effectively.Experience in managing and developing managers.About Meta:Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.$195,000/year to $267,000/year + bonus + equity + benefitsIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "pay_information": "\n      $195,000.00/yr - $267,000.00/yr\n    ",
        "job_description_page_link": "https://www.linkedin.com/jobs/view/manager-technical-program-management-at-meta-4186238977?trk=public_jobs_topcard-title",
        "job_location": [
            "Burlingame, CA"
        ]
    },
    {
        "job_title": "Manager, Technical Program Management",
        "company_name": "Meta",
        "job_description": "Are you looking to shape the future of computing? Reality Labs (RL) brings together cutting-edge research and engineering to develop products and experiences that advance immersive computing, helping people connect with entertainment, information, and one another.Reality Labs is developing software for both Augmented Reality (AR) and Virtual Reality (VR), serving billions of users worldwide. Our team is growing, and we are seeking experienced Technical Program Manager (TPM) Managers to align strategically with cross-functional teams and drive product programs for the Avatars and Economy teams. Meta Avatars enables billions of people to create digital representations of themselves and feel present together seamlessly across spaces, even when they are miles apart. The Economy team powers how hundreds of millions of people buy digital goods from millions of World Creators and App Developers.As a TPM Manager, you will lead and support a team of TPMs to drive highly cross-functional projects that shape the way users interact with our devices. This role involves collaborating with software engineers, interaction designers, release management, and quality assurance teams, integrating their efforts into a cohesive program and ensuring successful execution.Manager, Technical Program Management Responsibilities:Build, manage, and provide strategic direction for teams while supporting the growth and success of individual team members.Identify and address systemic, organization-wide challenges while fostering cross-functional relationships and driving influence. Collaborate with Product Management and Engineering to define business needs, support strategic planning and execution, and establish key metrics, program requirements, and scope.Serve as a cross-functional partner by leading technical discussions and providing thought leadership during product reviews. Take ownership of designing and implementing process and strategy frameworks that drive product-related goal setting, informed decision-making, and measurable business impact.Communicate your team’s technology requirements, goals, and milestones clearly to stakeholders, ensuring alignment and transparency throughout the development process.Leverage your technical expertise, industry knowledge, and awareness of emerging trends to drive informed decision-making and shape business strategy through data-driven analysis.Create and oversee comprehensive project plans, ensuring timely and successful delivery of all milestones.Lead program management efforts throughout all phases, including analysis, design, development, testing, implementation, and post-implementation.Manage risks and changes throughout the course of projects, ensuring timely identification and mitigation of potential issues.Shape program/product direction and streamline complexity for more efficient execution and delivery.Minimum Qualifications:Bachelor's degree in Computer Science or a related technical field, or equivalent experience.12+ years of experience in the software industry, including systems engineering, hardware engineering, or technical product/program management.7+ years of experience in people management, leading teams to deliver technical programs or products from inception to delivery.Experience communicating and presenting work to leadership, framing discussions to gather valuable feedback, and collaborating with technical management teams to develop systems, solutions, and products.Experience in analytical thinking and problem-solving with large-scale systems.Experience in establishing and leading teams through cross-disciplinary collaborations, including product management and engineering, to drive product impact.Preferred Qualifications:Experience in organizational design and scaling teams effectively.Experience in managing and developing managers.About Meta:Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.$195,000/year to $267,000/year + bonus + equity + benefitsIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "pay_information": "\n      $195,000.00/yr - $267,000.00/yr\n    ",
        "job_description_page_link": "https://www.linkedin.com/jobs/view/manager-technical-program-management-at-meta-4186236998?trk=public_jobs_topcard-title",
        "job_location": [
            "Seattle, WA"
        ]
    },
    {
        "job_title": "Manager, Technical Program Management - Capacity",
        "company_name": "Meta",
        "job_description": "Meta's infrastructure is vast and complex, spanning dozens of data center regions and powering over 10 million servers that run more than 5,000 services. Our team of Technical Program Managers (TPMs) is responsible for the core software infrastructure that supports this immense fleet, including compute, storage, GPU, and training capacity. We're driving a fundamental transformation across these domains, making significant strides in each area that will not only impact Meta but the entire industry.Technical Program Management (TPM) leaders at Meta collaborate with cross-functional teams of engineers, product managers, data scientists, and researchers to build and scale capacity systems. We are seeking a People Manager to lead a TPM team focused on creating systems and experiences that scale our infrastructure to support Meta’s ambitious growth and AI initiatives across our family of products.If you're ready for career-defining opportunities, tackling complex challenges, and making a meaningful impact on the future of technology, we would love to hear from you!Manager, Technical Program Management - Capacity Responsibilities:Lead a team of Technical Program Managers (TPMs) through the ideation, technical development, and launch of innovative products.Attract, build, manage, and develop a talented team of TPMs with diverse experiences, perspectives, approaches, and backgrounds.Create a unified direction across the company by driving alignment on priorities that propel product execution.Identify complex problems that require resolution and advocate for a compelling long-term technical direction to drive business success.Anticipate risks and issues ahead of time whenever possible, and take a proactive approach by examining the details, working directly, and collaborating with cross-functional partners to address and resolve challenges.Maximize efficiency in a continuously changing environment where processes are flexible, and inventive solutions are the standard.Manage cross-functional programs within a matrixed organization, covering multiple areas.Drive the adoption of technologies across various components of the product and/or infrastructure technical stack, while strategically advancing existing technology to the next level in an effective and efficient way.Minimum Qualifications:3+ years of experience in building and managing a team of Technical Program Managers (TPMs).Experience in recruiting, managing, and developing both individual contributors and leadership teams effectively.Experience in leading cross-functional programs, setting timelines, and holding teams accountable for meeting deliverables.Experience in communication and relationship-building, including collaboration within cross-functional teams.Experience in interpreting product requirements and translating them into actionable plans.Experience in strategic thinking and analytical leadership.Experience delivering presentations to leadership.Preferred Qualifications:Experience with API design principles, RESTful APIs, software development kits (SDKs), developer tools, and best practices for ensuring API privacy and security.Experience in navigating complex regulatory requirements and ensuring compliance.About Meta:Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.$167,000/year to $230,000/year + bonus + equity + benefitsIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "pay_information": "\n      $167,000.00/yr - $230,000.00/yr\n    ",
        "job_description_page_link": "https://www.linkedin.com/jobs/view/manager-technical-program-management-capacity-at-meta-4183212674?trk=public_jobs_topcard-title",
        "job_location": [
            "New York, NY"
        ]
    },
    {
        "job_title": "Manager, Technical Program Management - Reality Labs",
        "company_name": "Meta",
        "job_description": "Are you looking to shape the future of computing? Reality Labs (RL) is bringing together cutting edge research and engineering to deliver products and experiences for the future of immersive computing and connecting humans with entertainment, information and each other.Reality Labs is developing software for all realities—Augmented and Virtual—serving billions of users worldwide. Our team is growing, and we are seeking experienced Technical Program Manager (TPM) Managers to align strategically with cross-functional teams and deliver exceptional user experiences across RL products.Our mission is to develop user-facing software and experiences that engage billions of people, leveraging seamless integration with our core technologies in operating systems, computer vision, machine learning, and speech.As a TPM Manager, you will lead and grow a team of TPMs to drive highly cross-functional projects that shape the way users interact with our devices. This involves collaborating with software engineers, interaction designers, release management, and quality assurance teams, integrating their efforts into a cohesive program and driving it forward. You’ll play a pivotal role in defining how developers engage with Augmented Reality systems, both now and in the future, while being part of an organization that values career development and personal growth.The ideal candidate will have a solid technical program management background with demonstrated experience leading large projects across multiple software teams, as well as building and supporting teams. You must thrive in an entrepreneurial environment, navigating ambiguity and competing priorities with ease. This means you can not only manage teams and drive high-level strategic initiatives but also roll up your sleeves and get the job done.Manager, Technical Program Management - Reality Labs Responsibilities:Take responsibility for managing the team, including providing performance reviews, continuous feedback, coaching, and fostering career growth.Turn requirements into actionable plans that drive clarity, urgency, and alignment.Communicate with clarity and precision to ensure alignment across teams.Collaborate effectively, build relationships, and influence team members and cross-functional leaders to achieve product objectives.Collaborate with engineering, product, data, and design leadership to shape and execute the long-term strategy for your Reality Labs software organization.Collaborate with partner teams and leadership to ensure that what we build strikes the right balance between cost, risk, and benefit, while focusing on the highest priority business and customer needs.Minimum Qualifications:B.S. in Computer Science or a related technical discipline, or equivalent experience.7+ years of experience in the software industry or in technical product/program management.5+ years of people management experience, leading teams to deliver technical programs or products from inception to delivery.Proven communication and collaboration skills, including relationship-building within cross-functional teams.Experience with ambiguity and change, and bringing clarity to the team.Experience delivering techology programs or products from inception to delivery.Demonstrated experience leading teams to deliver highly ambiguous and complex products and programs.Experience in analytical thinking and problem-solving with large-scale software systems.About Meta:Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.$195,000/year to $267,000/year + bonus + equity + benefitsIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "pay_information": "\n      $195,000.00/yr - $267,000.00/yr\n    ",
        "job_description_page_link": "https://www.linkedin.com/jobs/view/manager-technical-program-management-reality-labs-at-meta-4187149646?trk=public_jobs_topcard-title",
        "job_location": [
            "Redmond, WA"
        ]
    },
    {
        "job_title": "Sr. Manager, Tech Program Mgmt, Ring Program Management",
        "company_name": "Ring",
        "job_description": "DescriptionAt Ring, our mission is to keep people close to what’s important. The Ring Program Management team is seeking a talented and motivated Sr. Manager, Technical Program Management. In the Ring Program Management team, you will launch innovative hardware products, drive the delivery of features, and enhance existing products in line with our product roadmap. You will have a high degree of ownership over deliverables to achieve business objectives.The Sr. Manager, TPM will manage a global team and engage in the full project lifecycle of large complex innovative programs aimed at delivering the next generation of Ring products. This position is responsible for the planning and execution of complex large-scale programs. We are looking for someone who is a strong communicator, is highly organized and a proven collaborator across hardware, firmware, software, manufacturing and product teams. A successful candidate will thrive in a fast-paced environment, embrace ambiguity, be a masterful influencer of business and technical leaders, and drive end-to-end product development.We are looking for entrepreneurial, innovative individuals who thrive on solving complex problems. Maturity, high judgment, negotiation skills, ability to influence, analytical talent, and leadership are essential to success in this role. You will anticipate bottlenecks, provide escalation management, anticipate and make tradeoffs, and balance customer and business needs versus technical constraints. An ability to take large, complex projects and break them down into manageable pieces and then deliver them in a successful and timely manner is expected.Key job responsibilitiesJoining our team provides the unique challenge and opportunity to build innovative products and services that benefit millions of customers. The ideal candidate will draw upon exemplary leadership skills, program management, critical thinking, and problem-solving skills. The candidate should be open to new challenges, strong at multi-tasking, innovative, creative, self-directed and a great team player. Candidates should drive continuous process improvement, and collaborate effectively with global, cross-functional product and engineering teams to solve problems and implement new solutions.ResponsibilitiesThe Senior Manager, TPM will collaborate with internal and external engineering and operations teams to conceive and design innovative products. You will work closely with an internal inter-disciplinary team to drive key aspects of product definition, execution, test and delivery. You must be responsive, flexible and able to succeed within an open collaborative peer environment. You will work closely with Product Managers to derive the product requirements and with Engineering Managers to drive execution. Specific responsibilities include: Lead cross-functional teams to deliver on key programs and goals of the business. Develop and drive program schedules and report to product and engineering management on status towards timelines and deliverables. Manage internal and external cross team dependencies, making sure that all teams are ready to deliver and align accordingly Drive consensus on technical decisions and ensure the appropriate resources are employed to deliver high quality results Identify, assess and mitigate issues and risks at the program and product line level. Develop mechanisms to improve program management practices and consistency across the organization. Drive effective teamwork, communication, collaboration and commitment across multiple groups with competing priorities Develop and leverage metrics to improve quality, speed and consistency of delivery across teams. Develop employees through hands-on coaching, mentoring and performance management. Build a high-performance team by creating opportunities aligned with organizational goals and career aspirations.Basic Qualifications Bachelor's degree in Computer Science, Engineering or related technical field 10+ years in hardware development across full product life cycles including scoping, planning, design, development, testing, compliance, manufacturing and launch. 10+ years managing scope, schedule and resources across multiple cross-functional hardware and software engineering teams 7+ years of people leadership experience 5+ years as a Technical Program Manager or Engineering Project Manager 5+ years of relevant experience in consumer products and/or services 3+ years of cloud and mobile app development experience Track record of managing cross functional hardware technology programs including mechanical, electrical, regulatory, firmware, software, and manufacturing. Demonstrated ability to deliver multiple projects in parallel Demonstrated proficiency in core project management disciplines including scope, schedule, budget, resources, quality and risk management, reporting and metric development/tracking Ability to handle multiple competing priorities in a fast-paced, matrix environment Excellent written and oral communication skills, proven problem-solving skills, and strong organizational skills Experience in building a high-performing team. Ability to travel as requiredPreferred Qualifications Master’s degree preferred Strong business acumen in combination with technical experience Proven ability to build relationships, influence others, and facilitate agreement among stakeholders with different interests Self-starter with an ability to motivate teams and deliver results Proven record of working with product and engineering leadership to deliver products and services Strong interpersonal, analytical, creative problem-solving, and negotiation skills Project Management ProfessionalAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.Los Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $175,200/year in our lowest geographic market up to $302,900/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.Company - Amazon.com Services LLCJob ID: A2872408\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "pay_information": "\n      $175,200.00/yr - $302,900.00/yr\n    ",
        "job_description_page_link": "https://www.linkedin.com/jobs/view/sr-manager-tech-program-mgmt-ring-program-management-at-ring-4138249170?trk=public_jobs_topcard-title",
        "job_location": [
            "Austin, TX"
        ]
    },
    {
        "job_title": "Technical Program Manager (L5), Content Promotion & Distribution",
        "company_name": "Netflix",
        "job_description": "Netflix is one of the world's leading entertainment services, with 283 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.Content Promotion and Distribution (CPD) sits at the intersection of the consumer experience and the Netflix Studio. Our team is integral to making the Netflix experience feel personal and relevant by developing innovative approaches to how we catalog, promote, localize, and distribute content.The Content Promotion and Distribution (CPD) Engineering Organization creates technology to set up, promote, localize, and launch content on the Netflix service and off-service on social channels. We build products and services that manage a global entertainment catalog and enable our members to discover, choose, and talk about the content they can watch or play.Within CPD, we are hiring 2 Technical Program Managers.ResponsibilitiesLead multiple cross-functional programs, in collaboration with product, engineering, design, and data science, that deliver technical solutions.Foster relationships, partner with key stakeholders and form technical strategies with engineering partners. Drive engagement with cross-functional partners, work to decompose requirements into technical execution plans with measurable milestones, effectively optimize scope and schedule, manage cross-functional dependencies, and proactively manage risks.Craft clear communication of progress toward goals, reporting status to stakeholders and leadership.Requirements5+ years of technical program management experienceProven experience driving complex software development to completion, ensuring timely delivery and alignment with business objectives.Highly skilled, experienced, and enjoys orchestrating multiple programs with many moving parts and creating partnerships with cross-functional teamsStrong understanding of software development processes and methodologiesAbility to understand and discuss technical concepts, manage trade-offs, and evaluate new ideas with internal and external partners.Excellent written and verbal communication skills, including the ability to clearly articulate business impact and technical constraints tailored to the audienceExemplify the Netflix culture by understanding, advocating, and demonstrating its values.Nice to haveHands-on experience with software development or engineeringIndustry experience in business domains of consumer products or marketingOur compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $720,000.Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.Netflix is a unique culture and environment. Learn more here.Inclusion is a Netflix value and we strive to host a meaningful interview experience for all candidates. If you want an accommodation/adjustment for a disability or any other reason during the hiring process, please send a request to your recruiting partner.We are an equal-opportunity employer and celebrate diversity, recognizing that diversity builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "pay_information": "Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $720,000.",
        "job_description_page_link": "https://www.linkedin.com/jobs/view/technical-program-manager-l5-content-promotion-distribution-at-netflix-4184496720?trk=public_jobs_topcard-title",
        "job_location": [
            "Los Gatos, CA"
        ]
    },
    {
        "job_title": "Technical Program Manager - InfoSec (onsite HQ Santa Clara 3 days per wk)",
        "company_name": "Palo Alto Networks",
        "job_description": "Our MissionAt Palo Alto Networks® everything starts and ends with our mission:Being the cybersecurity partner of choice, protecting our digital way of life.Our vision is a world where each day is safer and more secure than the one before. We are a company built on the foundation of challenging and disrupting the way things are done, and we’re looking for innovators who are as committed to shaping the future of cybersecurity as we are.Who We AreWe take our mission of protecting the digital way of life seriously. We are relentless in protecting our customers and we believe that the unique ideas of every member of our team contributes to our collective success. Our values were crowdsourced by employees and are brought to life through each of us everyday - from disruptive innovation and collaboration, to execution. From showing up for each other with integrity to creating an environment where we all feel included.As a member of our team, you will be shaping the future of cybersecurity. We work fast, value ongoing learning, and we respect each employee as a unique individual. Knowing we all have different needs, our development and personal wellbeing programs are designed to give you choice in how you are supported. This includes our FLEXBenefits wellbeing spending account with over 1,000 eligible items selected by employees, our mental and financial health resources, and our personalized learning opportunities - just to name a few!At Palo Alto Networks, we believe in the power of collaboration and value in-person interactions. This is why our employees generally work full time from our office with flexibility offered where needed. This setup fosters casual conversations, problem-solving, and trusted relationships. Our goal is to create an environment where we all win with precision.Job DescriptionYour Career Your Career Our Information Security team is seeking an early-career Technical Program Manager to coordinate and implement information security projects. This role is ideal for a motivated individual who thrives in dynamic environments, embraces continuous learning, exhibits a positive attitude, and excels at teamwork.Your Impact Improve and automate processes for the technical program management team.Lead smaller-scale security initiatives across various teams.Develop and present key metrics in accessible formats to measure the success of strategic programs and initiatives.Author clear functional specifications for critical projects to facilitate effective technical discussions among stakeholders.Gain deep understanding of the relevant systems, including their limitations, scalability, constraints, and architectural rationale.QualificationsYour Experience2-3 years of experience as a software developer or QA engineer in a sizable engineering team.Basic understanding and experience in technical program management.Proven ability to manage and prioritize team backlogs.Excellent skills in delivering clear, concise, transparent, and insightful status updates to team members, executives, and diverse stakeholders.Skilled in resolving project conflicts and establishing effective resolution paths.Working knowledge of Python, Java, Shell scripting, and awareness of emerging AI technologies.Working knowledge of tools like JIRA (or similar bug tracking software) and Tableau (or comparable data visualization tools).EducationBachelor's degree from an accredited four-year institution or equivalent training, education, and experience in Information Security, Cybersecurity, Computer Systems, IT, or related fields.Additional InformationThe Team Imagine ensuring security for a cybersecurity leader. Joining our Information Security team offers a rare chance to collaborate with some of technology's sharpest minds. Our global teams are at the forefront, defending against cyber threats. We share a unified mission, motivated by the profound impact of securing our digital way of life. Be part of a dynamic, energetic team that embraces challenges and passionately resolves security vulnerabilities to protect privacy.Compensation DisclosureThe compensation offered for this position will depend on qualifications, experience, and work location. For candidates who receive an offer at the posted level, the starting base salary (for non-sales roles) or base salary + commission target (for sales/commissioned roles) is expected to be between $94000 - $153000/YR. The offered compensation may also include restricted stock units and a bonus. A description of our employee benefits may be found here.#LC1Our CommitmentWe’re problem solvers that take risks and challenge cybersecurity’s status quo. It’s simple: we can’t accomplish our mission without diverse teams innovating, together.We are committed to providing reasonable accommodations for all qualified individuals with a disability. If you require assistance or accommodation due to a disability or special need, please contact us at accommodations@paloaltonetworks.com.Palo Alto Networks is an equal opportunity employer. We celebrate diversity in our workplace, and all qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or other legally protected characteristics.All your information will be kept confidential according to EEO guidelines.Is role eligible for Immigration Sponsorship?: Yes\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "pay_information": "The compensation offered for this position will depend on qualifications, experience, and work location. For candidates who receive an offer at the posted level, the starting base salary (for non-sales roles) or base salary + commission target (for sales/commissioned roles) is expected to be between $94000 - $153000/YR. The offered compensation may also include restricted stock units and a bonus. A description of our employee benefits may be found here.",
        "job_description_page_link": "https://www.linkedin.com/jobs/view/technical-program-manager-infosec-onsite-hq-santa-clara-3-days-per-wk-at-palo-alto-networks-4195177801?trk=public_jobs_topcard-title",
        "job_location": [
            "Santa Clara, CA"
        ]
    }
]